Revit 2027 API
SunAndShadowSettings.ProjectLocationName Property
 Identifies the name of the project location used by the SunAndShadowSettings element.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public string ProjectLocationName { get; }
Public ReadOnly Property ProjectLocationName As String
	Get
public:
property String^ ProjectLocationName {
	String^ get ();
}
member ProjectLocationName : string with get
Property Value
String
See Also
Reference
SunAndShadowSettings Class
Autodesk.Revit.DB Namespace